CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_usbfs_library/driver/Include/drv_usb_regs.h
/* device OUT endpoint-x interrupt flag register bits definitions */
#define DOEPINTF_BTBSTP           BIT(6)              /*!< back-to-back SETUP packets */
#define DOEPINTF_EPRXFOVR         BIT(4)              /*!< endpoint Rx FIFO overrun */
#define DOEPINTF_STPF             BIT(3)              /*!< SETUP phase finished */
#define DOEPINTF_EPDIS            BIT(1)              /*!< endpoint disabled */
#define DOEPINTF_TF               BIT(0)              /*!< transfer finished */

/* device IN endpoint 0 transfer length register bits definitions */
#define DIEP0LEN_PCNT             BITS(19, 20)        /*!< packet count */
#define DIEP0LEN_TLEN             BITS(0, 6)          /*!< transfer length */

/* device OUT endpoint 0 transfer length register bits definitions */
#define DOEP0LEN_STPCNT           BITS(29, 30)        /*!< SETUP packet count */
#define DOEP0LEN_PCNT             BIT(19)             /*!< packet count */
#define DOEP0LEN_TLEN             BITS(0, 6)          /*!< transfer length */

/* device OUT endpoint-x transfer length register bits definitions */
#define DOEPLEN_RXDPID            BITS(29, 30)        /*!< received data PID */
#define DOEPLEN_STPCNT            BITS(29, 30)        /*!< SETUP packet count */
#define DEPLEN_PCNT               BITS(19, 28)        /*!< packet count */
#define DEPLEN_TLEN               BITS(0, 18)         /*!< transfer length */

/* device IN endpoint-x transmit FIFO status register bits definitions */
#define DIEPTFSTAT_IEPTFS         BITS(0, 15)         /*!< IN endpoint Tx FIFO space remaining */

/* USB power and clock registers bits definition */
#define PWRCLKCTL_SHCLK           BIT(1)              /*!< stop HCLK */
#define PWRCLKCTL_SUCLK           BIT(0)              /*!< stop the USB clock */

#define RSTAT_GOUT_NAK                  1U    /* global OUT NAK (triggers an interrupt) */
#define RSTAT_DATA_UPDT                 2U    /* OUT data packet received */
#define RSTAT_XFER_COMP                 3U    /* OUT transfer completed (triggers an interrupt) */
#define RSTAT_SETUP_COMP                4U    /* SETUP transaction completed (triggers an interrupt) */
#define RSTAT_SETUP_UPDT                6U    /* SETUP data packet received */

#define DPID_DATA0                      0U    /* device endpoint data PID is DATA0 */
#define DPID_DATA1                      2U    /* device endpoint data PID is DATA1 */
#define DPID_DATA2                      1U    /* device endpoint data PID is DATA2 */
#define DPID_MDATA                      3U    /* device endpoint data PID is MDATA */

#define DCFG_PFRI(regval)         (DCFG_EOPFT & ((regval) << 11))  /*!< end of periodic frame time configuration */

#define FRAME_INTERVAL_80         DCFG_PFRI(0U)                     /*!< 80% of the frame time */
#define FRAME_INTERVAL_85         DCFG_PFRI(1U)                     /*!< 85% of the frame time */
#define FRAME_INTERVAL_90         DCFG_PFRI(2U)                     /*!< 90% of the frame time */
#define FRAME_INTERVAL_95         DCFG_PFRI(3U)                     /*!< 95% of the frame time */

#define DEP0_MPL(regval)          (DEP0CTL_MPL & ((regval) << 0))  /*!< maximum packet length configuration */

#define EP0MPL_64                 DEP0_MPL(0U)                      /*!< maximum packet length 64 bytes */
#define EP0MPL_32                 DEP0_MPL(1U)                      /*!< maximum packet length 32 bytes */
#define EP0MPL_16                 DEP0_MPL(2U)                      /*!< maximum packet length 16 bytes */
#define EP0MPL_8                  DEP0_MPL(3U)                      /*!< maximum packet length 8 bytes */

#define DOEP0_TLEN(regval)        (DOEP0LEN_TLEN & ((regval) << 0))     /*!< Transfer length */
#define DOEP0_PCNT(regval)        (DOEP0LEN_PCNT & ((regval) << 19))    /*!< Packet count */
#define DOEP0_STPCNT(regval)      (DOEP0LEN_STPCNT & ((regval) << 29))  /*!< SETUP packet count */

#define GRXSTS_PKTSTS_IN                        2U
#define GRXSTS_PKTSTS_IN_XFER_COMP              3U
#define GRXSTS_PKTSTS_DATA_TOGGLE_ERR           5U
#define GRXSTS_PKTSTS_CH_HALTED                 7U

#define HCTL_30_60MHZ                           0U                      /*!< USB clock 30-60MHZ */
#define HCTL_48MHZ                              1U                      /*!< USB clock 48MHZ */
#define HCTL_6MHZ                               2U                      /*!< USB clock 6MHZ */

#define EP0_OUT                   ((uint8_t)0x00)                       /*!< endpoint out 0 */
#define EP0_IN                    ((uint8_t)0x80)                       /*!< endpoint in 0 */
#define EP1_OUT                   ((uint8_t)0x01)                       /*!< endpoint out 1 */
#define EP1_IN                    ((uint8_t)0x81)                       /*!< endpoint in 1 */
#define EP2_OUT                   ((uint8_t)0x02)                       /*!< endpoint out 2 */
#define EP2_IN                    ((uint8_t)0x82)                       /*!< endpoint in 2 */
#define EP3_OUT                   ((uint8_t)0x03)                       /*!< endpoint out 3 */
#define EP3_IN                    ((uint8_t)0x83)                       /*!< endpoint in 3 */

#endif /* __DRV_USB_REGS_H */
